readme adjust
